{
  "articles": [
    {
      "source": "Vulture",
      "author": "Ile-Ife Okantah",
      "title": "The Real Housewives of Atlanta Recap: Jab Jabs and Kikis",
      "description": "A vacation rarely brings a cast closer together instead of farther apart, yet Grenada serves as a refreshing baptism for the Atlanta ladies.",
      "url": "http://www.vulture.com/article/real-housewives-of-atlanta-recap-season-16-episode-15-chapter-3-renew.html",
      "urlToImage": "https://pyxis.nymag.com/v1/imgs/c90/1e2/bb5b80ac2969ae549b112aa33096e25d50-NUP-205251-00584.1x.rsocial.w1200.jpg",
      "publishedAt": "2025-06-16T01:53:50Z",
      "content": "A vacation rarely brings a cast closer together instead of farther apart unless you count trauma bonding, then any Housewives trip to Puerto Rico would definitely count yet Grenada serves as a refres…..."
    },
    {
      "source": "Johnaugust.com",
      "author": "Drew Marquardt",
      "title": "Scriptnotes, Episode 690: Living and Writing in Sci-Fi Times, Transcript",
      "description": "The original post for this episode can be found here. Episode 690 John August: Hello and welcome. My name is John August. Craig Mazin: My name is Craig Mazin. John: You’re listening to Episode 690 of Scriptnotes. It’s a podcast about screenwriting and things …",
      "url": "https://johnaugust.com/2025/scriptnotes-episode-690-living-and-writing-in-sci-fi-times-transcript",
      "urlToImage": "https://johnaugust.com/wp-content/uploads/2021/04/ja-tw-card-small.png",
      "publishedAt": "2025-06-17T22:32:29Z",
      "content": "The original post for this episode can be found here.\r\nEpisode 690\r\nJohn August: Hello and welcome. My name is John August.\r\nCraig Mazin: My name is Craig Mazin.\r\nJohn: Youre listening to Episode 690…..."
    },
    {
      "source": "Uncannymagazine.com",
      "author": "Catherynne M. Valente",
      "title": "When He Calls Your Name",
      "description": "There’s nights in the deep end of summer so hot and thick and wet you can feel the dark wrinkling up your fingers like bathwater—and my last night breathing was one of those. 2 a.m. came to ring my bell and found me perfectly awake, swinging back and forth on…",
      "url": "https://www.uncannymagazine.com/article/when-he-calls-your-name/",
      "urlToImage": "https://www.uncannymagazine.com/wp-content/uploads/2025/06/Issue-65-cover-med-683x1024.jpg",
      "publishedAt": "2025-07-01T10:00:38Z",
      "content": "Theres nights in the deep end of summer so hot and thick and wet you can feel the dark wrinkling up your fingers like bathwaterand my last night breathing was one of those.\r\n2 a.m. came to ring my be…..."
    }
  ]
}