{
  "articles": [
    {
      "title": "AI Videos of Black Women Depicted as Primates Are Going Viral",
      "description": "Some Instagram creators are using Google’s Veo 3 and racking up millions of views on AI videos of “bigfoot baddies.” They’ll teach you how to make them for $15.",
      "url": "https://www.wired.com/story/ai-videos-black-women-depicted-as-primates-viral/"
    },
    {
      "title": "Today's NYT Strands Hints, Answers and Help for June 4, #458",
      "description": "Here's today's Strands answers and hints. These clues will help you solve The New York Times' popular puzzle game, Strands, every day.",
      "url": "https://www.cnet.com/tech/gaming/todays-nyt-strands-hints-answers-and-help-for-june-4-458/"
    },
    {
      "title": "NYT ‘Strands’ Today: Hints, Spangram And Answers For Wednesday, June 4th",
      "description": "Looking for help with today's NYT Strands puzzle? Here's an extra hint to help you uncover the right words, as well as all of today's answers and Spangram.",
      "url": "https://www.forbes.com/sites/erikkain/2025/06/03/nyt-strands-today-hints-spangram-and-answers-for-wednesday-june-4th/"
    },
    {
      "title": "NYT Strands hints and answers for Thursday, June 5 (game #459)",
      "description": "Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.",
      "url": "https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-5-june-2025"
    },
    {
      "title": "Moth Hill Launches From Afterlight Comics In December 2025 Solicits",
      "description": "Moth Hill is a new horror comic by  Joseph Oliveira and Chris W Jany coming from Afterlight Comics in their September 2025 solicits and solicitations, though reaching US comic book stores in December. As is the collection of the Silence series by Evan K. Pozi…",
      "url": "https://bleedingcool.com/comics/moth-hill-afterlight-december-2025-solicits/"
    },
    {
      "title": "were rejoining the global consciousness",
      "description": "Today on Married To The Sea: were rejoining the global consciousnessThis RSS feed is brought to you by Drew and Natalie's podcast Garbage Brain University. Our new series Everything Is Real explores\nthe world of cryptids, aliens, quantum physics, the occult, …",
      "url": "https://www.marriedtothesea.com/index.php?date=061125"
    },
    {
      "title": "the only thing that matters",
      "description": "Today on Married To The Sea: the only thing that mattersThis RSS feed is brought to you by Drew and Natalie's podcast Garbage Brain University. Our new series Everything Is Real explores\nthe world of cryptids, aliens, quantum physics, the occult, and more. If…",
      "url": "https://www.marriedtothesea.com/index.php?date=061825"
    },
    {
      "title": "only one dollar",
      "description": "Today on Married To The Sea: only one dollarThis RSS feed is brought to you by Drew and Natalie's podcast Garbage Brain University. Our new series Everything Is Real explores\nthe world of cryptids, aliens, quantum physics, the occult, and more. If you use thi…",
      "url": "https://www.marriedtothesea.com/index.php?date=062525"
    },
    {
      "title": "artificially intelligent agents",
      "description": "Today on Married To The Sea: artificially intelligent agentsThis RSS feed is brought to you by Drew and Natalie's podcast Garbage Brain University. Our new series Everything Is Real explores\nthe world of cryptids, aliens, quantum physics, the occult, and more…",
      "url": "https://www.marriedtothesea.com/index.php?date=060625"
    },
    {
      "title": "come take a ride",
      "description": "Today on Married To The Sea: come take a rideThis RSS feed is brought to you by Drew and Natalie's podcast Garbage Brain University. Our new series Everything Is Real explores\nthe world of cryptids, aliens, quantum physics, the occult, and more. If you use th…",
      "url": "https://www.marriedtothesea.com/index.php?date=070225"
    }
  ]
}